# Taps
tap 'homebrew/cask'

# Binaries
brew 'git'
brew 'mas'
brew 'bash' # latest Bash version
brew 'mackup'
brew 'dnsmasq'
brew 'coreutils' # those that come with macOS are outdated

# Development
brew 'gd'
brew 'php' # latest version of PHP
brew 'node'
brew 'yarn'
brew 'nginx'
brew 'php@7.3'
brew 'mariadb'
brew 'composer'
brew 'imagemagick'

# Apps
cask 'vlc'
cask 'iterm2'
cask 'docker'
cask 'spotify'
cask 'dropbox'
cask 'station'
cask 'tableplus'
cask 'balenaetcher'
cask 'paragon-ntfs'
cask 'brave-browser'
cask 'keepingyouawake'
cask 'visual-studio-code'
cask 'adobe-creative-cloud'

# Quicklook
cask 'qlmarkdown'
cask 'qlcolorcode'
cask 'quicklook-csv'
cask 'quicklook-json'

# App Store
mas 'Spark', id: 1176895641
mas 'Magnet', id: 441258766
mas '1Password 7', id: 1333542190
mas 'The Unarchiver', id: 425424353
mas 'Microsoft Word', id: 462054704
#mas 'Microsoft Excel', id: 462058435
mas 'Microsoft Outlook', id: 985367838
